/*
        7                          7
       / \                        / \
      4   18(y)  <---左旋----    4   11🔄(x)
         /  \                        /  \
       11(x) 19                     9   18(y)
       /  \                             /  \
      9    14                          14   19
      
     1,根据x求得y节点.y=x.right
                 7
                / \
               4   11🔄(x)
                   /  \
                  9   18(y)
                      /  \
                     14   19
     2,把y的左孩子设置为x的右孩子,x.right = y.left
                 7
                / \
               4   11🔄(x)
                   /  \
                  9   14
                  
                      18(y)
                      /  \
                     14   19 
       这导致x的右节点连接断开了,但是y节点的父节点指向11这层关系还在,
       而且,14的父节点是y=18这层关系也在的,这就不合理了,要改变.
     3,首先考虑的是把14的父节点设置为x
       y.left.p = x ,不画出14的父节点时图像和上面是一样的.
                 7
                / \
               4   11🔄(x)
                   /  \
                  9   14
                  
                      18(y)
                      /  \
                     14   19 
     4,现在要把y的父节点设置成x的父节点,这可以不移动图像,看起来还是一样的.
       y.p = x.p
                 7
                / \
               4   11🔄(x)
                   /  \
                  9   14
                  
                      18(y)
                      /  \
                     14   19 
      5,x的父节点,因为可以根据x.p找到这个节点.,把x的父节点的右节点设置为y
        x.p.right = y, 上一步已经把y的父节点设置好了,这步设置左右子树.
                 7
                / \
               4   18(y)
                   /  \
                  14   19   
                  
         这步 y节点就移动好了        
                  11🔄(x)
                   /  \
                  9   14
       6,把y的左节点设置为x, y.left=x
                 7
                / \
               4   18(y)
                   /  \
                  14   19   
                  /    
               11🔄(x)  x的父节点设置成y,这步只是改变了左右子树,但x的父还是指向77
                /  \    这种情况是要改变的
               9   14       
                  
        7,x.p = y;
                 7
                / \
               4   18(y)
                   /  \
                  14   19   
                  /    
               11🔄(x)  x的父节点设置成y,这步只是改变了左右子树,但x的父还是指向77
                /  \    这种情况是要改变的
               9   14                              
 */
var isEmpty = require("./判断红黑树节点是否为空");
// 左旋
function leftRotate(t, x) {
    var y = x.right;
    x.right = y.left
    // if(y.left!=null) 
    if(!isEmpty(y.left))
        y.left.p = x;
    y.p = x.p;
    // if(x.p==null) 
    if(isEmpty(x.p))
        t.root = y;
    else if(x==x.p.left) x.p.left = y;
    else x.p.right = y;
    y.left= x;
    x.p = y;
}

module.exports = leftRotate;








