/**
 * https://www.cnblogs.com/ECJTUACM-873284962/p/6935506.html
 * 假设小哼班上5个同学,这5个同学分别考了5分,3分,5分,2分,8分(满分10分)
 * 现在要进行排序.
 * 1,首先要申请一个大小为11的数组,因为10分有0..10共11段
 *   [⬜    ⬜   ⬜    ⬜    ⬜   ⬜   ⬜   ⬜    ⬜   ⬜    ⬜  ],
 *    a[0] a[1] a[2] a[3] a[4] a[5] a[6] a[7] a[8] a[9] a[10]
 * 2,接下来把这11个数组每个元素都初始化为0
 *   [🅾   🅾   🅾   🅾    🅾   🅾    🅾    🅾   🅾   🅾    🅾  ],
 *   a[0] a[1] a[2] a[3] a[4] a[5] a[6] a[7] a[8] a[9] a[10]
 * 3,现在开始处理每一个人的分数,第1个人分数是5分,我们就在对应的a[5]的值的
 *   基础上加1,即a[5]的值从0改为1,表示5分出现过一次.
 *   [🅾   🅾   🅾   🅾    🅾   ①    🅾    🅾   🅾   🅾    🅾  ],
 *   a[0] a[1] a[2] a[3] a[4] a[5] a[6] a[7] a[8] a[9] a[10]
 */

function countingSort(a,b,k) {
    var c = new Array(k);
    for(let i=0;i<c.length;i++){c[i] = 0}
    console.log("初始化数组c           :",c);
    // 遍历a数组,a[j]-->a[0],a[1]...a[4]
    for (let j=0;j<a.length;j++){
        //c[5]=a[5]+1
        // c数组下标5的元素表示5元素出现的次数2次
        // c数组下标2的元素表示2元素出现的次数1次
        c[a[j]] = c[a[j]]+1
    }
    console.log("与c下标相同元素出现次数:",c)
    for(let i=0;i<c.length;i++){ //依次遍历c数组
        for(let j=1;j<=c[i];j++){ 
            // c[i]的值是i元素出现的次数,
            // 例如:c[2]表示a数组中的2元素出现次数是1次,所以2打印1次
            process.stdout.write(i+"  ")
        }
    }
}
var a = [5,3,5,2,8];
var b = [];
var k = 11;
countingSort(a,b,k)







